In [4]:
import pandas as pd

In [5]:
data = pd.read_csv('/content/drive/My Drive/data/carprices.csv')

In [6]:
data.columns = ['CarModel', 'Mileage', 'SellPrice', 'Age']

In [7]:
data.head()

  CarModel  Mileage  SellPrice  Age
0   BMW X5    69000      18000    6
1   BMW X5    35000      34000    3
2   BMW X5    57000      26100    5
3   BMW X5    22500      40000    2
4   BMW X5    46000      31500    4

# Dummy Variables:

In [8]:
dummies = pd.get_dummies(data.CarModel)
dummies

    Audi A5  BMW X5  Mercedez Benz C class
0         0       1                      0
1         0       1                      0
2         0       1                      0
3         0       1                      0
4         0       1                      0
5         1       0                      0
6         1       0                      0
7         1       0                      0
8         1       0                      0
9         0       0                      1
10        0       0                      1
11        0       0                      1
12        0       0                      1

In [9]:
merged = pd.concat([data, dummies], axis='columns')
merged

                 CarModel  Mileage  ...  BMW X5  Mercedez Benz C class
0                  BMW X5    69000  ...       1                      0
1                  BMW X5    35000  ...       1                      0
2                  BMW X5    57000  ...       1                      0
3                  BMW X5    22500  ...       1                      0
4                  BMW X5    46000  ...       1                      0
5                 Audi A5    59000  ...       0                      0
6                 Audi A5    52000  ...       0                      0
7                 Audi A5    72000  ...       0                      0
8                 Audi A5    91000  ...       0                      0
9   Mercedez Benz C class    67000  ...       0                      1
10  Mercedez Benz C class    83000  ...       0                      1
11  Mercedez Benz C class    79000  ...       0                      1
12  Mercedez Benz C class    59000  ...       0                      1

[13 rows x 7 columns]

In [10]:
final = merged.drop(['CarModel', 'Audi A5'], axis='columns')
final.columns = ['Mileage', 'SellPrice', 'Age', 'BMWX5', 'MercedezBensCclass']
final.head()

   Mileage  SellPrice  Age  BMWX5  MercedezBensCclass
0    69000      18000    6      1                   0
1    35000      34000    3      1                   0
2    57000      26100    5      1                   0
3    22500      40000    2      1                   0
4    46000      31500    4      1                   0

In [11]:
X = final.drop('SellPrice', axis='columns')
y = final.SellPrice

In [12]:
from sklearn.linear_model import LinearRegression

In [13]:
model = LinearRegression()
model.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [14]:
p = model.predict([[40000, 4, 1, 0]])
p

array([32103.72035689])

In [15]:
model.score(X,y)

0.9417050937281083

# OneHotEncoding

In [16]:
from sklearn.preprocessing import LabelEncoder

In [18]:
le = LabelEncoder()
datale = data
datale.CarModel = le.fit_transform(datale.CarModel)
datale

    CarModel  Mileage  SellPrice  Age
0          1    69000      18000    6
1          1    35000      34000    3
2          1    57000      26100    5
3          1    22500      40000    2
4          1    46000      31500    4
5          0    59000      29400    5
6          0    52000      32000    5
7          0    72000      19300    6
8          0    91000      12000    8
9          2    67000      22000    6
10         2    83000      20000    7
11         2    79000      21000    7
12         2    59000      33000    5

In [36]:
X = datale.drop('SellPrice', axis='columns')
y = datale.SellPrice

In [26]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(handle_unknown='ignore')
X = ohe.fit_transform(X).toarray()

array([[0., 1., 1., ..., 1., 1., 0.],
       [0., 1., 1., ..., 1., 1., 0.],
       [0., 1., 1., ..., 1., 1., 0.],
       ...,
       [0., 1., 1., ..., 1., 1., 0.],
       [0., 1., 1., ..., 1., 1., 0.],
       [0., 1., 1., ..., 1., 1., 0.]])

In [29]:
X = X[:,1:]
X

array([[0., 1., 0., ..., 1., 1., 0.],
       [0., 1., 0., ..., 1., 1., 0.],
       [0., 1., 0., ..., 1., 1., 0.],
       ...,
       [0., 0., 1., ..., 1., 1., 0.],
       [0., 0., 1., ..., 1., 1., 0.],
       [0., 0., 1., ..., 1., 1., 0.]])

In [41]:
y = datale['SellPrice']

In [42]:
model = LinearRegression()
model.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [43]:
p = model.predict([[1,40000, 4]])
p

array([34294.01618465])

In [44]:
model.score(X,y)

0.8719970367825953